<?php
/*
author:star
整体思路:
1:先将传入的字符串分割为单个字符,并放到一个数组$arr1中,
2:利用for循环,将数组$arr1中的每个元素都转为16进制数,并做点修饰
3:将$arr1的每个元素提取出来,拼接到字符串$str1中,拼接完成后发现美中不足的是在最前面有个点,下面代码进行优化
4:重复第一步,将$str1切割,得到数组$arr2
5:利用unset()函数去除$arr2的第一个元素,即第3步提到的点
6.利用for循环将$arr2中的元素提取出来并进行拼接,得到目标$str2
*/
fwrite(STDOUT, "请输入要转化的字符串: \n"); //https://blog.csdn.net/e421083458/article/details/8077297
$str = trim(fgets(STDIN));
echo sprintf("您输入的内容是: %s\n",$str);
$arr1 = str_split($str); //第1步


$str1 = '';  //初始化
for($b=0;$b<sizeof($arr1);$b++){
    $c = '.chr(0x'.bin2hex($arr1[$b]).')'; //第2步将数组中的每个元素都转为16进制,并作适当修饰,形成字符串
    $str1 .= $c;  //第3步:将这些字符串拼接起来
}
//print($str1);//发现在最前面多了一个点
$arr2 = str_split($str1); //第4步
unset($arr2[0]); //第5步:删除数组中第一个元素,删除之后数组的下表从1开始
$str2 = '';//初始化
for($b=1;$b<sizeof($arr2)+1;$b++){  //因为下标从0开始,所以这里$b的值要从原来的0改为1
    $c = $arr2[$b]; //第6步:将数组中的每个元素都转为16进制,并作适当修饰,形成字符串
    $str2 .= $c;  //将这些字符串拼接起来
}
print('转为chr()方式的结果为: '.$str2."\n".'类型为: '.gettype($str2)."\n");